<a href="https://colab.research.google.com/github/N-A-K/TakeHomeExam2021autumn/blob/main/TakeHomeExam.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

1.Read in the ramen ratings file as a dataframe

2.set appropriate index and column names and print out an overview of the dataframe

3.Print a subset of the dataframe that only has the information of the brand of ramen and its score (hint: not groupby, or creation of new dataframe. How can we access specific rows or columns of data?)

4.Oh no, it seems the last column is full of null values. Convert these to NaN.

5.Display only the rows where the brand is Nissin and the rating is above 3.5 (some data type conversion might be necessary)

6.Group the ramen by brand and calculate the mean, max, and min values in a single output.

7.What is the mode rating for all ramen?

8.Groupby brand and variety. Can you figure out a way to display this information in descending order (highest to lowest)? Which has the highest average?

9.How many different brands of ramen are included in the dataset?

1.Read in the ramen ratings file as a dataframe

In [166]:
import pandas as pd #import pandas and set the first column as index
df = pd.read_csv('/content/ramen-ratings.csv', index_col=0)

2.set appropriate index and column names and print out an overview of the dataframe

In [167]:
df.columns #look at the column names

Index(['Brand', 'Variety', 'Style', 'Country', 'Stars', 'Top Ten'], dtype='object')

In [168]:
df.rename(columns = {'Variety': 'Ramen', 'Stars': 'Score', 'Top Ten':'Ranking'},inplace=True)
#change df itself

In [169]:
df.sort_values('Review #',ascending=True,inplace=True)

In [170]:
df.head()

             Brand  ... Ranking
Review #            ...
1         Westbrae  ...     NaN
2          Wai Wai  ...     NaN
3          Wai Wai  ...     NaN
4          Wai Wai  ...     NaN
5            Vifon  ...     NaN

[5 rows x 6 columns]

3.Print a subset of the dataframe that only has the information of the brand of ramen and its score (hint: not groupby, or creation of new dataframe. How can we access specific rows or columns of data?)

In [171]:
df_new = df.loc[:, ['Brand','Score']]

In [172]:
df_new.head()

             Brand Score
Review #
1         Westbrae   0.5
2          Wai Wai     2
3          Wai Wai     2
4          Wai Wai     1
5            Vifon   3.5

4.Oh no, it seems the last column is full of null values. Convert these to NaN.

In [173]:
df.isnull().sum() #find null values

Brand         0
Ramen         0
Style         2
Country       0
Score         0
Ranking    2539
dtype: int64

In [174]:
df.fillna('NaN') #NaN -> NaN(str) ?

                   Brand  ... Ranking
Review #                  ...
1               Westbrae  ...     NaN
2                Wai Wai  ...     NaN
3                Wai Wai  ...     NaN
4                Wai Wai  ...     NaN
5                  Vifon  ...     NaN
...                  ...  ...     ...
2576      Ching's Secret  ...     NaN
2577             Wei Lih  ...     NaN
2578              Nissin  ...     NaN
2579            Just Way  ...     NaN
2580           New Touch  ...     NaN

[2580 rows x 6 columns]

5.Display only the rows where the brand is Nissin and the rating is above 3.5 (some data type conversion might be necessary)

In [175]:
dfNissin = df.loc[(df.Brand == "Nissin") & (df.Score >= '3.5')]
dfNissin

           Brand  ... Ranking
Review #          ...
23        Nissin  ...     NaN
26        Nissin  ...     NaN
27        Nissin  ...     NaN
28        Nissin  ...     NaN
70        Nissin  ...     NaN
...          ...  ...     ...
2549      Nissin  ...     NaN
2553      Nissin  ...     NaN
2560      Nissin  ...     NaN
2566      Nissin  ...     NaN
2567      Nissin  ...     NaN

[305 rows x 6 columns]

6.Group the ramen by brand and calculate the mean, max, and min values in a single output.

In [176]:
import numpy as np

In [177]:
df.info() #I think the type of Score should be float64

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2580 entries, 1 to 2580
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Brand    2580 non-null   object
 1   Ramen    2580 non-null   object
 2   Style    2578 non-null   object
 3   Country  2580 non-null   object
 4   Score    2580 non-null   object
 5   Ranking  41 non-null     object
dtypes: object(6)
memory usage: 141.1+ KB

In [178]:
#change
df['Score'] = pd.to_numeric(df['Score'],errors = 'coerce')

In [179]:
#check
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2580 entries, 1 to 2580
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Brand    2580 non-null   object
 1   Ramen    2580 non-null   object
 2   Style    2578 non-null   object
 3   Country  2580 non-null   object
 4   Score    2577 non-null   float64
 5   Ranking  41 non-null     object
dtypes: float64(1), object(5)
memory usage: 141.1+ KB

In [180]:
df.groupby("Brand").Score.agg([np.mean, max, min])

                      mean   max   min
Brand
1 To 3 Noodles    4.000000  4.00  4.00
7 Select          3.750000  4.00  3.50
7 Select/Nissin   3.500000  3.50  3.50
A-One             2.750000  3.50  1.25
A-Sha Dry Noodle  4.067308  5.00  2.00
...                    ...   ...   ...
Yum Yum           3.750000  5.00  3.00
Yum-Mie           3.500000  3.50  3.50
Zow Zow           3.750000  3.75  3.75
iMee              3.500000  4.50  2.75
iNoodle           3.000000  3.75  2.25

[355 rows x 3 columns]

7.What is the mode rating for all ramen?

In [181]:
df['Ramen'].mode()

0       Beef
1    Chicken
dtype: object

8.Groupby brand and variety. Can you figure out a way to display this information in descending order (highest to lowest)? Which has the highest average?

In [186]:
grouped = df.groupby(["Brand", "Ramen"]).Score.mean()
grouped = grouped.sort_values(ascending=False)
grouped.head()
#groupby works?

Brand     Ramen
Takamori  Hearty Japanese Style Curry Udon                        5.0
TTL       Sesame Oil Chicken Noodle With Rice Wine                5.0
Song Hak  Rice Topokki                                            5.0
Nissin    Gyoretsu-no-Dekiru-Mise-no-Ramen (Shrimp Tantanmen)     5.0
Mama      Instant Cup Noodles Shrimp Tom Yum Flavour (Extreme)    5.0
Name: Score, dtype: float64

9.How many different brands of ramen are included in the dataset?

In [187]:
df['Brand'].nunique()

355